app/Http/Controllers/Auth/RegisterController.php

insert into `city_managers` (`user_id`, `NID`, `updated_at`, `created_at`) values (30, '6465487987897', '2022-05-06 23:19:42', '2022-05-06 23:19:42')
insert into `gym_managers` (`user_id`, `NID`, `gym_id`, `updated_at`, `created_at`) values (31, '46545465456464', '13', '2022-05-06 23:23:18', '2022-05-06 23:23:18')
---
    protected function create(array $data)
    {

        $user = User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
            'position_id' => $data['position_id'] ,
        ]);
        $role = 'user';
        if ($data['position_id'] == 1) {
            $role = 'admin';

        } else if ($data['position_id'] == 2) {
            CityManager::create(
                [
                    'user_id' => $user->id,
                    'NID' => $data['cmanager_NID']
                ]
            );