app/Http/Controllers/Api/UserController.php

    public function login(Request $request)
    {
        $request->validate([
            'email' => 'required|email',
            'password' => 'required',
            'device_name' => 'required',
        ]);

        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'yaya@iti.com' limit 1