app/Http/Resources/GymManagerResource.php

select * from `gyms` where `gyms`.`id` = 7 limit 1
---
    public function toArray($request)
    {
        return [
            'name'=> $this->name,
            'id' => $this->id,
            'email'=>$this->email,
            'created_at'=>$this->created_at->format('y-m-d'),
            'profile_image'=>$this->profile_image,
            'gym_name'=> $this->gym_managers->first()->gym->name,
        ];