app/Http/Controllers/CityManagerController.php

    public function index(Request $request)
    {
        {if ($request->ajax()) {
            $data = CityManager::all();
---
select * from `city_managers`

    public function edit($city_managerId)
    {
        $city_managers=CityManager::find($city_managerId);
---
select * from `city_managers` where `city_managers`.`id` = '38' limit 1