app/Http/Controllers/CityManagerController.php

select * from `users` where `possession_id` = 2
---
    public function index(Request $request)
    { {
            if ($request->ajax()) {
                $cityMangers = User::where("possession_id",2)->get();