app/Http/Controllers/CoachController.php

select * from `coaches`
---
    public function index()
    {
        $coaches = Coach::all();

insert into `coaches` (`name`, `updated_at`, `created_at`) values ('esraa', '2022-05-06 03:49:46', '2022-05-06 03:49:46')
---
    public function store(StoreCoachRequest $request)
    {
        Coach::create([
            'name' =>  $request['name'],
        ]);

select * from `coaches` where `coaches`.`id` = '2' limit 1
delete from `coaches` where `id` = 2
---
    public function destroy($coachId){
        $coach = Coach::find(11);
        if($coach){
            $deleted=$coach->delete();