app/Http/Controllers/GymController.php

    public function index()
    {

        $gyms = Gym::all();
---
select * from `gyms`

    public function getAll(Request $request)
    {
        if ($request->ajax()) {
            $data = Gym::all();
---
select * from `gyms` order by `created_at` desc