app/Http/Controllers/GymManagerController.php

    public function destroy($gym_managerId)
    {
        $user = User::find($gym_managerId);
        if ($user) {
            $gym_manager = GymManager::where('user_id', $user->id)->first();
            $gym_manager->delete();
---
delete from `gym_managers` where `id` = 2