app/Http/Controllers/GymManagerController.php

    public function index(Request $request)
    {
        if ($request->ajax()) {
            $gymMangers = User::where("possession_id",3)->get();
---
select * from `users` where `possession_id` = 3

    public function create()
    {
        $gyms = Gym::all();
---
select * from `gyms`

    public function store(StoreGymManagerRequest $request)
    {
        if ($request->hasFile('fileUpload')) {
            $image = $request->file('fileUpload');
            $name = $image->getClientOriginalName();
            $imagePath = $request->file('fileUpload')->storeAs('public/images/', $name);

            $user = User::create([
                'name' => $request->name,
                'email' => $request->email,
                'password' => Hash::make($request->password),
                'profile_image' => $name,
                'possession_id' => 3,
            ]);
            $manager=GymManager::create([
                'user_id' => $user->id,
                'gym_id' => $request->gym_id,
                'NID' =>$request->NID,
            ]);
---
insert into `users` (`name`, `email`, `password`, `profile_image`, `possession_id`, `updated_at`, `created_at`) values ('fffff', 'ff@gmailll.com', '$2y$10$SN5ZQzkk/FkrWw4iKd.zrufODx1dSqDsoirnmA5/IQSSkBYEoTJnK', 'tree-736885__480.jpg', 3, '2022-05-07 02:11:43', '2022-05-07 02:11:43')
insert into `gym_managers` (`user_id`, `gym_id`, `NID`, `updated_at`, `created_at`) values (45, '18', '789541235', '2022-05-07 02:11:43', '2022-05-07 02:11:43')

    public function edit($gym_managerId)
    {
        $gym_managers = User::find($gym_managerId);
        $gyms = Gym::all();
---
select * from `users` where `users`.`id` = '44' limit 1
select * from `gyms`