app/Http/Controllers/TrainingSessionController.php

select * from `coaches`
select * from `training_packages`
---
    public function create()
    {
        $coaches = Coach::all();
        $trainingPackages = TrainingPackage::all();

select * from `coaches`
select * from `training_packages`
---
    public function edit(TrainingSession $trainingSession)
    {
        $coaches = Coach::all();
        $trainingPackages = TrainingPackage::all();