app/Http/Controllers/TrainingPackageController.php

select * from `training_packages`
---
    public function index()
    {

        $trainingPackages = TrainingPackage::all();