app/Http/Controllers/UserController.php

    public function index(Request $request)
    {
        if ($request->ajax()) {
            $data = User::where("position_id",4)->get();
---
select * from `users` where `position_id` = 4