app/Http/Controllers/UserController.php

select * from `users`
---
    public function index(Request $request)
    {

        if ($request->ajax()) {
            $data = User::all();

insert into `users` (`name`, `email`, `password`, `date_of_birth`, `gender`, `profile_image`, `position_id`, `updated_at`, `created_at`) values ('fady', 'fady@yahoo.com', '$2y$10$MZ6H3wPEFJveEy7HxV4mhu1egtA2pZdOLYADw9wG/8qesvrifPMdy', '1998-06-01', 'male', 'pexels-photo-733853.jpg', 4, '2022-05-07 02:39:04', '2022-05-07 02:39:04')
---
    public function store(StoreUserRequest $request)
    {
        if ($request->hasFile('fileUpload')) {
            $image = $request->file('fileUpload');
            $name = $image->getClientOriginalName();
            $imagePath = $request->file('fileUpload')->storeAs('public/images/', $name);
            User::create([
                'name' =>  $request['name'],
                'email' =>  $request['email'],
                'password' => Hash::make($request->password),
                'date_of_birth' => $request['date_of_birth'],
                'gender' => $request['gender'],
                'profile_image' => $name,
                'role_id' => 4,
            ]);

select * from `users` where `users`.`id` = '13' limit 1
---
    public function edit($userId)
    {
        $users = User::find($userId);

select * from `users` where `users`.`id` = 11 limit 1
---
    public function update(UpdateUserRequest $request, $userId)

    {
        $user = User::find($userId);

select * from `users` where `users`.`id` = '6' limit 1
delete from `users` where `id` = 6
---
    public function destroy($userId)
    {
        $user = User::find($userId);
        if ($user) {
            if ($user->training_sessions()->count()) {
                return response()->json(["status" => false, "message" => "can't delete this user because still having sessions"], 200);
            }
            $deleted = $user->delete();